<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DepartmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $department = [
            'Руководство Министерства',
            'Управление демографической политики',
            'Отдел организации работы с семьей и детьми',
            'Отдел организации работы по опеке и попечительству',
            'Отдел организации социальной поддержки населения',
            'Управление социального обслуживания',
            'Отдел организации социального обслуживания',
            'Отдел по делам инвалидов',
            'Отдел организационной работы и делопроизводства',
            'Управление планирования, исполнения бюджета и регулирования оплаты труда',
            'Отдел исполнения бюджета',
            'Отдел методического обеспечения и регулирования оплаты труда',
            'Отдел бюджетного планирования и финансово-экономического анализа',
            'Отдел бухгалтерского учета и отчетности',
            'Отдел государственных закупок',
            'Отдел укрепления материально-технической базы',
            'Управление правового сопровождения мер социальной поддержки',
            'Отдел методологии мер социальной поддержки',
            'Отдел организации работы по жилищным субсидиям и предоставлению гарантий гражданам, пострадавшим от воздействия радиации',
            'Отдел организации назначения государственных пособий',
            'Управление по организации предоставления выплат и сопровождению информационных систем',
            'Отдел организации предоставления мер социальной поддержки',
            'Отдел по сопровождению информационных систем',
            'Отдел организации выплаты социальных пособий и компенсаций',
            'Управление проектной деятельности',
            'Отдел координации проектов',
            'Отдел мониторинга и аналитической работы',
            'Служба по работе со средствами массовой информации',
            'Юридический отдел',
            'Отдел государственной службы и кадров',
            'Контрольно-ревизионный отдел',
            'Служба информационной безопасности',
            ];
    }
}
